Repository: markizano/gtksourceview-1
Catalog: po/*.po
Languages: pa

source: Escape Character
pa: ਅਸਕੇਪ ਕਰੈਕਟਰ

source: Escaping character for syntax patterns
pa: ਸੰਟੈਕਸਟ ਤਰਤੀਬ ਲੲੀ ਅਸਕੇਪ ਕਰੈਕਟਰ

source: Check Brackets
pa: ਚੈਕ ਬਰੈਕਟ

source: Whether to check and highlight matching brackets
pa: ਕੀ ਮੇਲ ਖਾਦੀਅਾ ਬਰੈਕਟ੾ ਦੀ ਜ੾ਚ ਕਰਨੀ ਹੈ ਅਤੇ ੳੁਭਾਰਨ ਹੈ

source: Highlight
pa: ੳੁਭਾਰਨਾ

source: Whether to highlight syntax in the buffer
pa: ਕੀ ਬਫ਼ਰ ਵਿੱਚ ਸੰਟੈਕਸਟ ਨੰੂ ੳੁਭਾਰਨਾ ਹੈ

source: Maximum Undo Levels
pa: ਅਧਿਕਤਮ ਮੁੜ ਕਰਨ ਯੋਗ ਪਗ

source: Number of undo levels for the buffer
pa: ਬਫ਼ਰ ਵਿੱਚੋ ਮੁੜ ਕਰਨ ਯੋਗ ਪਗ੾ ਦੀ ਗਿਣਤੀ

source: Language
pa: ਭਾਸ਼ਾ

source: Language object to get highlighting patterns from
pa: ਭਾਸ਼ਾ ੲਿਕਾੲੀ, ੳੁਭਾਰਵੀ ਤਰਤੀਬ ਪ੍ਾਪਤ ਕਰੇ

source: Language specification directories
pa: ਭਾਸ਼ਾ ਨਿਰਧਾਰਮ ਡਾੲਿਰੈਕਟਰੀਅ੾

source: List of directories where the language specification files (.lang) are located
pa: ਡਾੲਿਰੈਕਟਰੀ ਦੀ ਸੂਚੀ ਜਿਥੇ ਕਿ ਭਾਸ਼ਾ ਨਿਰਧਾਰਨ ਫਾੲਿਲ(.lang) ਸਥਿਤ ਹਨ

source: Configuration
pa: ਸੰਰਚਨਾ

source: Configuration options for the print job
pa: ਸੰਰਚਨਾ ਚੋਣ ਛਾਪਣ ਕਾਰਜ ਲੲੀ

source: Source Buffer
pa: ਸਰੋਤ ਬਫ਼ਰ

source: GtkSourceBuffer object to print
pa: ਛਾਪਣ ਲੲੀ GtkSourceBuffer ੲਿਕਾੲੀ

source: Tabs Width
pa: ਟੈਬ ਦੀ ਚੌੜਾੲੀ

source: Width in equivalent space characters of tabs
pa: ਟੈਬ ਦੀ ਚੌੜਾੲੀ ਬਰਾਬਰ ਦੀਅ੾ ਖਾਲ਼ੀ ਥ੾ਵ੾

source: Wrap Mode
pa: ਲਪੇਟੋ ਮੋਡ

source: Word wrapping mode
pa: ਸ਼ਬਦ ਲਪੇਟਣ ਮੋਡ

source: Whether to print the document with highlighted syntax
pa: ਕੀ ਦਸਤਾਵੇਜ਼ ਨੰੂ ੳੁਭਾਰੇ ਸੰਟੈਕਸਟ ਨਾਲ ਹੀ ਛਾਪਣਾ ਹੈ

source: Font
pa: ਫੋਟ

source: Font name to use for the document text
pa: ਦਸਤਾਵੇਜ਼ ਪਾਠ ਲੲੀ ਵਰਤਣ ਲੲੀ ਫੋਟ ਨਾੳੁ

source: Numbers Font
pa: ਨੰਬਰ ਫੋਟ

source: Font name to use for the line numbers
pa: ਸਤਰ ਨੰਬਰ ਛਾਪਣ ਲੲੀ ਵਰਤਣੇ ਫੋਟ

source: Print Line Numbers
pa: ਸਤਰ ਨੰ ਛਾਪੋ

source: Interval of printed line numbers (0 means no numbers)
pa: ਛਾਪਣ ਲੲੀ ਸਤਰ ਨੰਬਰ ਦਾ ਅੰਤਰਾਲ ( ੦ ਦਾ ਅਰਥ ਹੈ ਕੋੲੀ ਨੰਬਰ ਨਹੀ)

source: Print Header
pa: ਹੈਡਰ ਛਾਪੋ

source: Whether to print a header in each page
pa: ਕੀ ਹਰੇਕ ਸਫੇ ਤੇ ਹੈਡਰ ਛਾਪਣਾ ਹੈ

source: Print Footer
pa: ਫੁਟਰ ਛਾਪੋ

source: Whether to print a footer in each page
pa: ਕੀ ਹਰੇਕ ਸਫੇ ਤੇ ਫੁਟਰ ਛਾਪਣਾ ਹੈ

source: Header and Footer Font
pa: ਹੈਡਰ ਤੇ ਫੁਟਰ ਫੋਟ

source: Font name to use for the header and footer
pa: ਹੈਡਰ ਤੇ ਫੁਟਰ ਲੲੀ ਫੋਟ ਨਾੳੁ

source: Base-N Integer
pa: ਅਧਾਰ-N ਪੂਰਨ ਅੰਕ

source: Character
pa: ਕਰੈਕਟਰ

source: Comment
pa: ਟਿੱਪਣੀ

source: Data Type
pa: ਮਿਤੀ ਕਿਸਮ

source: Function
pa: ਫੰਕਸ਼ਨ

source: Decimal
pa: ਦਸ਼ਮਲਵ

source: Floating Point
pa: ਫਲੋਟਿੰਗ ਬਿੰਦੂ

source: Keyword
pa: ਕੀ-ਵਰਡ

source: Preprocessor
pa: ਪਰੀ-ਪਰੋਸੈਸਰ

source: String
pa: ਸਤਰ

source: Specials
pa: ਖਾਸ

source: Others
pa: ਹੋਰ

source: Others 2
pa: ਹੋਰ ੨

source: Others 3
pa: ਹੋਰ ੩

source: Default
pa: ਮੂਲ

source: Tag ID
pa: ਟੈਗ ਸ਼ੰਨ-ਨੰ

source: ID used to refer to the source tag
pa: ਸ਼ੰਨ-ਨੰ ਸਰੋਤ ਟੈਗ ਨੰੂ ਹਵਾਲਾ ਦੇਣ ਦੇ ਕੰਮ ਅਾੳੁਦਾ ਹੈ

source: Tag style
pa: ਟੈਗ ਸ਼ੈਲੀ

source: The style associated to the source tag
pa: ਸਰੋਤ ਟੈਗ ਨਾਲ ਸੰਬੰਧਿਤ ਸ਼ੈਲੀ

source: Show Line Numbers
pa: ਸਤਰ ਨੰਬਰ ਵੇਖਾੳੁ

source: Whether to display line numbers
pa: ਕੀ ਸਤਰ ਨੰਬਰ ਨੰੂ ਵੇਖਾੳੁਣਾ ਹੈ

source: Show Line Markers
pa: ਸਤਰ ਨਿਸ਼ਾਨਕਾਰ ਵੇਖਾੳੁ

source: Whether to display line marker pixbufs
pa: ਕੀ ਸਤਰ ਨਿਸ਼ਾਨਕਾਰ ਪਿਕਬਫ਼ ਨੰੂ ਵੇਖਾੳੁਣਾ ਹੈ

source: Auto Indentation
pa: ਸਵੈ ਹਾਸ਼ੀੲੇ ਤੋ ਦੂਰ

source: Whether to enable auto indentation
pa: ਕੀ ਸਵੈ ਹਾਸ਼ੀੲੇ ਤੋ ਦੂਰ ਨੰੂ ਯੋਗ ਕਰਨਾ ਹੈ

source: Insert Spaces Instead of Tabs
pa: ਟੈਬ ਦੀ ਬਜਾੲੇ ਖਾਲੀ ਥ੾ ਦਿੳੁ

source: Whether to insert spaces instead of tabs
pa: ਕੀ ਟੈਬ ਦੀ ਬਜਾੲੇ ਖਾਲੀ ਥ੾ ਦੇਣੀ ਹੈ

source: Show Right Margin
pa: ਸੱਜਾ ਹਾਸ਼ੀਅਾ ਵੇਖਾੳੁ

source: Whether to display the right margin
pa: ਕੀ ਸੱਜਾ ਹਾਸ਼ੀਅਾ ਵੇਖਾੳੁਣਾ ਹੈ

source: Margin position
pa: ਹਾਸ਼ੀਅਾ ਸਥਿਤੀ

source: Position of the right margin
pa: ਸੱਜੇ ਹਾਸ਼ੀੲੇ ਦੀ ਸਥਿਤੀ

source: Use smart home/end
pa: ਵਰਤੋ ਕੁਸ਼ਲ ਘਰ/ਖਤਮ

source: HOME and END keys move to first/last characters on line first before going to the start/end of the line
pa: HOME ਅਤੇ END ਕੀ, ਸਤਰ ਵਿੱਚ ਪਹਿਲੇ/ਅਖੀਰੀ ਅੱਖਰ੾ ਤੇ ਭੇਜਦੀਅ੾ ਹਨ, ਸਤਰ ਦੇਸ਼ੁਰੂ/ਖਤਮ ਹੋਣ ਤੋ ਪਹਿਲ੾

source: Ada
pa: ਅਦਾ

source: Character Constant
pa: ਕਰੈਕਟਰ ਕੋਨਸਟੈਟ

source: Keywords
pa: ਕੀ-ਵਰਡ

source: Line Comment
pa: ਸਤਰ ਟਿੱਪਣੀ

source: Number
pa: ਨੰਬਰ

source: Preprocessor Keywords
pa: ਪਰੀਪੋਰਸੈਸਰ ਕੀ-ਵਰਡ

source: Sources
pa: ਸਰੋਤ

source: True And False
pa: ਸੱਚ ਤੇ ਝੂਠ

source: Types
pa: ਕਿਸਮ੾

source: '#if 0' Comment
pa: '#if 0' ਟਿੱਪਣੀ

source: Block Comment
pa: ਬਲਾਕ ਟਿੱਪਣੀ

source: C
pa: ਸੀ

source: Common Macro
pa: ਅਾਮ ਮਾੲੀਕਰੋ

source: Floating Point Number
pa: ਫਲੋੲਿੰਗ ਅੰਕ

source: Hex Number
pa: ਹੈਕਸਾ ਨੰਬਰ

source: Octal Number
pa: ਓਕਟਲ ਨੰਬਰ

source: Preprocessor Definitions
pa: ਪਰੀਪਰੋਸੈਸਰ ਪ੍ੀਭਾਸ਼ਾ

source: C++
pa: ਸੀ++

source: C#
pa: ਸੀ#

source: Primitives
pa: ਮੌਲਿਕ

source: String 2
pa: ਸਤਰ ੨

source: Boolean Value
pa: ਬੂਲੀਅਨ ਮੁੱਲ

source: Encoding
pa: ੲਿੰਕੋਡਿੰਗ

source: Exec Parameter
pa: Exec ਪੈਰਾਮੀਟਰ

source: Group
pa: ਸਮੂਹ

source: Non Standard Key
pa: ਕੋੲੀ ਮਿਅਾਰੀ ਕੀ ਨਹੀ

source: Standard Key
pa: ਮਿਅਾਰੀ ਕੀ

source: Added line
pa: ਸਤਰ ਜੋੜੀ

source: Changed line
pa: ਸਤਰ ਤਬਦੀਲ

source: Diff
pa: ਅੰਤਰ

source: Diff file
pa: ਫਾੲਿਲ ਅੰਤਰ

source: Location
pa: ਸਥਿਤੀ

source: Removed line
pa: ਸਤਰ ਹਟਾੲੀ

source: Special case
pa: ਖਾਸ ਪ੍ਸਥਿਤੀ(ਕੇਸ)

source: Attributes
pa: ਵਿਸ਼ੇਸਤਾ

source: Closing Bracket
pa: ਬਰੈਕਟ ਬੰਦ

source: Entity
pa: ੲਿਕਾੲੀ

source: HTML
pa: ਅੈਚਟੀਅੈਮਅੈਲ(HTML)

source: Markup
pa: ਨਿਸ਼ਾਨਬੱਧ

source: Tags
pa: ਟੈਗ

source: Sectional
pa: ਸ਼ੈਕਸ਼ਨ

source: Declarations
pa: ਅੈਲਾਨ(ਡੈਕਲਰੇਸ਼ਨ)

source: Flow
pa: ਵਹਾ(ਫਲੋ)

source: Java
pa: ਜਾਵਾ

source: Memory
pa: ਮੈਮੋਰੀ

source: Modifiers
pa: ਸੋਧਕ(ਮਾਡੀਫਾੲਿਰ)

source: Numeric
pa: ਅੰਕੀ(ਨੂਮੈਰਿਕ)

source: Include
pa: ਸ਼ਾਮਿਲ

source: Math
pa: ਗਣਿਤ

source: Most Used Commands
pa: ਅਾਮ ਵਰਤਦੀਅ੾ ਕਮ੾ਡ੾

source: Function Call
pa: ਫੰਕਸ਼ਨ ਕਾਲ

source: Perl
pa: ਪਰਲ

source: Scripts
pa: ਸਕਿ੍ਪਟ

source: String2
pa: ਸਤਰ੨

source: String3
pa: ਸਤਰ੩

source: Variables
pa: ਪਰਵਰਤਨਸ਼ੀਲ(ਵੇਰੀਬਲ)

source: Array Operators
pa: ਅਰੇ ਓਪਰੇਟਰ

source: Backtick String
pa: ਬੈਕਟਿਕ ਸਤਰ

source: Bash Line Comment
pa: ਬਾਸ਼ ਸਤਰ ਟਿੱਪਣੀ

source: C Block Comment
pa: ਸੀ(C) ਬਲਾਕ ਟਿੱਪਣੀ

source: C++ Line Comment
pa: ਸੀ(C)++ ਸਤਰ ਟਿੱਪਣੀ

source: Case Insensitive Keyword
pa: ਅਕਾਰ ਪ੍ਤੀ ਨਾ-ਸੰਵੇਦਨਸ਼ੀਲ ਕੀ-ਵਰਡ

source: Case Sensitive Keyword
pa: ਅਕਾਰ ਪ੍ਤੀ ਸੰਵੇਦਨਸ਼ੀਲ ਕੀ-ਵਰਡ

source: Double Quoted String
pa: ਦੂਹਰੇ ੳੁਪੱਰੀ ਕਾਮੇ ਸਤਰ

source: First Open PHP Tag
pa: ਪਹਿਲ੾ ਖੁੱਲਾ PHP ਟੈਗ

source: HTML Block
pa: HTML ਬਲਾਕ

source: Operators
pa: ਓਪਰੇਟਰ

source: PHP
pa: ਪੀਅੈਚਪੀ(PHP)

source: Single Quoted String
pa: ੲਿਕਹਰੇ ੳੁਪੱਰੀ ਕਾਮੇ ਸਤਰ

source: Variable
pa: ਵੇਰੀਬਲ

source: Format
pa: ਫਾਰਮਿਟ

source: gettext translation
pa: gettext ਤਬਦੀਲੀ

source: Functions
pa: ਫੰਕਸ਼ਨ

source: Module Handler
pa: ਮੈਡੀਲਿੳੂ ਹੈਡਲਰ

source: Multiline String
pa: ਬਹੁਕਤਾਰ ਸਤਰ

source: Multiline String 2
pa: ਬਹੁਕਤਾਰ ਸਤਰ ੨

source: Python
pa: ਪਾੲੀਥਾਨ(Python)

source: Self
pa: ਖੁਦ

source: ANSI Datatypes
pa: ANSI ਡਾਟਾ-ਟਾੲਿਪ

source: ANSI Reserved Words
pa: ANSI ਰਾਖਵੇ ਸ਼ਬਦ

source: Aggregate Functions
pa: ਅੈਗਰੀਗੇਟ ਫੰਕਸ਼ਨ

source: Analytic Functions
pa: ਅੈਨਾਲੇਟਿਕ ਫੰਕਸ਼ਨ

source: Character Functions Returning Character Values
pa: ਕਰੈਕਟਰ ਫੰਕਸ਼ਨ ਕਰੈਕਟਰ ਮੁੱਲ ਹੀ ਵਾਪਿਸ ਕਰੇਗਾ

source: Character Functions Returning Number Values
pa: ਕਰੈਕਟਰ ਫੰਕਸ਼ਨ ਅੰਕੀ ਮੁੱਲ ਵਾਪਿਸ ਕਰੇਗਾ

source: Conversion Functions
pa: ਤਬਦੀਲੀ(ਕੰਨਵਰਜ਼ਨ) ਫੰਕਸ਼ਨ

source: Datetime Functions
pa: ਮਿਤੀ-ਸਮ੾ ਫੰਕਸ਼ਨ

source: Integer Literals
pa: ੲੀਟੀਜ਼ਰ ਲਿਟਰਲ

source: Miscellaneous Single-Row Functions
pa: ਫੁਟਕਲ ੲਿੱਕ ਕਤਾਰ ਫੰਕਸ਼ਨ

source: Null
pa: ਖਾਲੀ(ਨਲ)

source: Number Functions
pa: ਨੰਬਰ ਫੰਕਸ਼ਨ

source: Number Literals
pa: ਨੰਬਰ ਲਿਟਰਲ

source: Object Reference Functions
pa: ਅਾਰਬਜੈਕਟ ਰੈਫਰਸ ਫੰਕਸ਼ਨ

source: Oracle Built-in Datatypes
pa: ਓਰੇਕਲ ਬਿਲਡ-ੲਿਨ ਡਾਟਾ-ਟਾੲਿਪ

source: Oracle Reserved Words
pa: ਓਰੇਕਲ ਰਾਖਵੇ ਸ਼ਬਦ

source: SQL*Plus At Sign
pa: SQL*Plus ਸਾੲਿਨ ਤੇ

source: SQL*Plus Commands
pa: SQL*Plus ਕਮ੾ਡ੾

source: SQL*Plus Double At Sign
pa: SQL*Plus Double ਸਾੲਿਨ ਤੇ

source: SQL/DS and DB2 Datatypes
pa: SQL/DS ਅਤੇ DB2 ਡਾਟਾ-ਟਾੲਿਪ

source: Size Clause
pa: ਅਕਾਰ ਕਲਾਜ਼

source: Text Literals
pa: ਪਾਠ ਲਿਟਰਲ

source: Unlimited
pa: ਬੇਹਿਸਾਬ

source: Binary Number
pa: ਬਾੲੀਨਰ ਅੰਕ

source: Decimal Number
pa: ਦਸ਼ਮਲਨ ਅੰਕ

source: Gates
pa: ਗੇਟ

source: Hexadecimal Number
pa: ਹੈਕਸਾਡੈਸੀਮਲ ਅੰਕ

source: Verilog
pa: ਵੇਰੀਲਾਗ

source: Hexadecimal
pa: ਹੈਕਸਾਡੈਸੀਮਲ

source: Tag
pa: ਟੈਗ

source: XML
pa: ਅੈਕਸਅੈਮਅੈਲ(XML)
